; domain
(define (domain satellite)
  (:requirements :strips :typing)
  (:types satellite direction instrument mode)
  (:predicates
	(on_board ?i - instrument ?s - satellite)
	(supports ?i - instrument ?m - mode)
	(pointing ?s - satellite ?d - direction)
	(power_avail ?s - satellite)
	(power_on ?i - instrument)
	(calibrated ?i - instrument)
	(have_image ?d - direction ?m - mode)
	(calibration_target ?i - instrument ?d - direction))

  (:action turn_to
   :parameters (?s - satellite ?d_new - direction ?d_prev - direction)
   :precondition (and (pointing ?s ?d_prev))
   :effect (and  (pointing ?s ?d_new)
                 (not (pointing ?s ?d_prev))))

  (:action switch_on
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s)
                      (power_avail ?s))
   :effect (and (power_on ?i)
                (not (calibrated ?i))
                (not (power_avail ?s))))

  (:action switch_off
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s)
                      (power_on ?i))
   :effect (and (not (power_on ?i))
                (power_avail ?s)))

  (:action calibrate
   :parameters (?s - satellite ?i - instrument ?d - direction)
   :precondition (and (on_board ?i ?s)
		      (calibration_target ?i ?d)
                      (pointing ?s ?d)
                      (power_on ?i))
   :effect (and (calibrated ?i)))

  (:action take_image
   :parameters (?s - satellite ?d - direction ?i - instrument ?m - mode)
   :precondition (and (calibrated ?i)
                      (on_board ?i ?s)
                      (supports ?i ?m)
                      (power_on ?i)
                      (pointing ?s ?d))
   :effect (and (have_image ?d ?m))))

; problem
(define (problem strips-sat-x-1)
(:domain satellite)
(:objects
	satellite0 - satellite
	instrument0 - instrument
	instrument1 - instrument
	instrument2 - instrument
	satellite1 - satellite
	instrument3 - instrument
	satellite2 - satellite
	instrument4 - instrument
	satellite3 - satellite
	instrument5 - instrument
	instrument6 - instrument
	instrument7 - instrument
	satellite4 - satellite
	instrument8 - instrument
	instrument9 - instrument
	infrared1 - mode
	infrared2 - mode
	spectrograph0 - mode
	Star2 - direction
	GroundStation3 - direction
	Star4 - direction
	GroundStation0 - direction
	Star1 - direction
	Phenomenon5 - direction
	Star6 - direction
	Star7 - direction
	Phenomenon8 - direction
	Planet9 - direction
	Star10 - direction
	Planet11 - direction
	Star12 - direction
	Star13 - direction
	Planet14 - direction
	Planet15 - direction
	Star16 - direction
	Star17 - direction
	Star18 - direction
	Star19 - direction
	Star20 - direction
	Star21 - direction
	Star22 - direction
	Phenomenon23 - direction
	Phenomenon24 - direction
	Planet25 - direction
	Phenomenon26 - direction
	Star27 - direction
	Star28 - direction
)
(:init
	(supports instrument0 infrared1)
	(supports instrument0 infrared2)
	(supports instrument0 spectrograph0)
	(calibration_target instrument0 Star2)
	(supports instrument1 infrared2)
	(supports instrument1 spectrograph0)
	(calibration_target instrument1 GroundStation3)
	(supports instrument2 infrared2)
	(calibration_target instrument2 GroundStation0)
	(on_board instrument0 satellite0)
	(on_board instrument1 satellite0)
	(on_board instrument2 satellite0)
	(power_avail satellite0)
	(pointing satellite0 Phenomenon5)
	(supports instrument3 infrared2)
	(calibration_target instrument3 Star1)
	(on_board instrument3 satellite1)
	(power_avail satellite1)
	(pointing satellite1 Star18)
	(supports instrument4 spectrograph0)
	(calibration_target instrument4 GroundStation3)
	(on_board instrument4 satellite2)
	(power_avail satellite2)
	(pointing satellite2 Planet25)
	(supports instrument5 infrared1)
	(supports instrument5 infrared2)
	(supports instrument5 spectrograph0)
	(calibration_target instrument5 GroundStation3)
	(supports instrument6 infrared1)
	(supports instrument6 infrared2)
	(supports instrument6 spectrograph0)
	(calibration_target instrument6 GroundStation0)
	(supports instrument7 spectrograph0)
	(supports instrument7 infrared1)
	(supports instrument7 infrared2)
	(calibration_target instrument7 Star4)
	(on_board instrument5 satellite3)
	(on_board instrument6 satellite3)
	(on_board instrument7 satellite3)
	(power_avail satellite3)
	(pointing satellite3 Star16)
	(supports instrument8 infrared1)
	(supports instrument8 infrared2)
	(calibration_target instrument8 GroundStation0)
	(supports instrument9 spectrograph0)
	(supports instrument9 infrared2)
	(supports instrument9 infrared1)
	(calibration_target instrument9 Star1)
	(on_board instrument8 satellite4)
	(on_board instrument9 satellite4)
	(power_avail satellite4)
	(pointing satellite4 Star19)
)
(:goal (and
	(pointing satellite1 Star19)
	(pointing satellite2 Phenomenon24)
	(pointing satellite3 Phenomenon26)
	(pointing satellite4 Star19)
	(have_image Phenomenon5 spectrograph0)
	(have_image Star6 infrared2)
	(have_image Star7 infrared2)
	(have_image Phenomenon8 infrared2)
	(have_image Planet9 spectrograph0)
	(have_image Star10 infrared2)
	(have_image Planet11 infrared2)
	(have_image Star12 infrared1)
	(have_image Star13 infrared1)
	(have_image Planet14 infrared2)
	(have_image Planet15 infrared1)
	(have_image Star16 spectrograph0)
	(have_image Star17 spectrograph0)
	(have_image Star18 infrared1)
	(have_image Star19 infrared1)
	(have_image Star21 infrared2)
	(have_image Star22 infrared2)
	(have_image Planet25 infrared1)
	(have_image Phenomenon26 infrared2)
	(have_image Star27 spectrograph0)
	(have_image Star28 infrared1)
))

)

; plan
1. (switch_on instrument8 satellite4)
   deleted: (power_avail satellite4)
   added: (power_on instrument8)
   goals met: 1 of 25
2. (switch_on instrument5 satellite3)
   deleted: (power_avail satellite3)
   added: (power_on instrument5)
   goals met: 1 of 25
3. (turn_to satellite4 groundstation0 star19)
   deleted: (pointing satellite4 star19)
   added: (pointing satellite4 groundstation0)
   goals met: 0 of 25
4. (calibrate satellite4 instrument8 groundstation0)
   added: (calibrated instrument8)
   goals met: 0 of 25
5. (turn_to satellite4 phenomenon26 groundstation0)
   deleted: (pointing satellite4 groundstation0)
   added: (pointing satellite4 phenomenon26)
   goals met: 0 of 25
6. (take_image satellite4 phenomenon26 instrument8 infrared2)
   added: (have_image phenomenon26 infrared2)
   goals met: 1 of 25
7. (turn_to satellite4 phenomenon8 phenomenon26)
   deleted: (pointing satellite4 phenomenon26)
   added: (pointing satellite4 phenomenon8)
   goals met: 1 of 25
8. (take_image satellite4 phenomenon8 instrument8 infrared2)
   added: (have_image phenomenon8 infrared2)
   goals met: 2 of 25
9. (turn_to satellite4 planet11 phenomenon8)
   deleted: (pointing satellite4 phenomenon8)
   added: (pointing satellite4 planet11)
   goals met: 2 of 25
10. (take_image satellite4 planet11 instrument8 infrared2)
   added: (have_image planet11 infrared2)
   goals met: 3 of 25
11. (turn_to satellite4 planet14 planet11)
   deleted: (pointing satellite4 planet11)
   added: (pointing satellite4 planet14)
   goals met: 3 of 25
12. (take_image satellite4 planet14 instrument8 infrared2)
   added: (have_image planet14 infrared2)
   goals met: 4 of 25
13. (turn_to satellite4 planet15 planet14)
   deleted: (pointing satellite4 planet14)
   added: (pointing satellite4 planet15)
   goals met: 4 of 25
14. (take_image satellite4 planet15 instrument8 infrared1)
   added: (have_image planet15 infrared1)
   goals met: 5 of 25
15. (turn_to satellite4 planet25 planet15)
   deleted: (pointing satellite4 planet15)
   added: (pointing satellite4 planet25)
   goals met: 5 of 25
16. (take_image satellite4 planet25 instrument8 infrared1)
   added: (have_image planet25 infrared1)
   goals met: 6 of 25
17. (turn_to satellite4 star10 planet25)
   deleted: (pointing satellite4 planet25)
   added: (pointing satellite4 star10)
   goals met: 6 of 25
18. (take_image satellite4 star10 instrument8 infrared2)
   added: (have_image star10 infrared2)
   goals met: 7 of 25
19. (turn_to satellite4 star12 star10)
   deleted: (pointing satellite4 star10)
   added: (pointing satellite4 star12)
   goals met: 7 of 25
20. (take_image satellite4 star12 instrument8 infrared1)
   added: (have_image star12 infrared1)
   goals met: 8 of 25
21. (turn_to satellite4 star13 star12)
   deleted: (pointing satellite4 star12)
   added: (pointing satellite4 star13)
   goals met: 8 of 25
22. (take_image satellite4 star13 instrument8 infrared1)
   added: (have_image star13 infrared1)
   goals met: 9 of 25
23. (turn_to satellite4 star18 star13)
   deleted: (pointing satellite4 star13)
   added: (pointing satellite4 star18)
   goals met: 9 of 25
24. (take_image satellite4 star18 instrument8 infrared1)
   added: (have_image star18 infrared1)
   goals met: 10 of 25
25. (turn_to satellite4 star19 star18)
   deleted: (pointing satellite4 star18)
   added: (pointing satellite4 star19)
   goals met: 11 of 25
26. (take_image satellite4 star19 instrument8 infrared1)
   added: (have_image star19 infrared1)
   goals met: 12 of 25
27. (turn_to satellite3 groundstation3 star16)
   deleted: (pointing satellite3 star16)
   added: (pointing satellite3 groundstation3)
   goals met: 12 of 25
28. (calibrate satellite3 instrument5 groundstation3)
   added: (calibrated instrument5)
   goals met: 12 of 25
29. (turn_to satellite3 phenomenon26 groundstation3)
   deleted: (pointing satellite3 groundstation3)
   added: (pointing satellite3 phenomenon26)
   goals met: 13 of 25
30. (turn_to satellite2 phenomenon24 planet25)
   deleted: (pointing satellite2 planet25)
   added: (pointing satellite2 phenomenon24)
   goals met: 14 of 25
31. (turn_to satellite1 star19 star18)
   deleted: (pointing satellite1 star18)
   added: (pointing satellite1 star19)
   goals met: 15 of 25
32. (turn_to satellite4 star21 star19)
   deleted: (pointing satellite4 star19)
   added: (pointing satellite4 star21)
   goals met: 14 of 25
33. (take_image satellite4 star21 instrument8 infrared2)
   added: (have_image star21 infrared2)
   goals met: 15 of 25
34. (turn_to satellite4 star19 star21)
   deleted: (pointing satellite4 star21)
   added: (pointing satellite4 star19)
   goals met: 16 of 25
35. (turn_to satellite4 star22 star19)
   deleted: (pointing satellite4 star19)
   added: (pointing satellite4 star22)
   goals met: 15 of 25
36. (take_image satellite4 star22 instrument8 infrared2)
   added: (have_image star22 infrared2)
   goals met: 16 of 25
37. (turn_to satellite4 star19 star22)
   deleted: (pointing satellite4 star22)
   added: (pointing satellite4 star19)
   goals met: 17 of 25
38. (turn_to satellite4 star28 star19)
   deleted: (pointing satellite4 star19)
   added: (pointing satellite4 star28)
   goals met: 16 of 25
39. (take_image satellite4 star28 instrument8 infrared1)
   added: (have_image star28 infrared1)
   goals met: 17 of 25
40. (turn_to satellite4 star19 star28)
   deleted: (pointing satellite4 star28)
   added: (pointing satellite4 star19)
   goals met: 18 of 25
41. (turn_to satellite4 star6 star19)
   deleted: (pointing satellite4 star19)
   added: (pointing satellite4 star6)
   goals met: 17 of 25
42. (take_image satellite4 star6 instrument8 infrared2)
   added: (have_image star6 infrared2)
   goals met: 18 of 25
43. (turn_to satellite4 star19 star6)
   deleted: (pointing satellite4 star6)
   added: (pointing satellite4 star19)
   goals met: 19 of 25
44. (turn_to satellite4 star7 star19)
   deleted: (pointing satellite4 star19)
   added: (pointing satellite4 star7)
   goals met: 18 of 25
45. (take_image satellite4 star7 instrument8 infrared2)
   added: (have_image star7 infrared2)
   goals met: 19 of 25
46. (turn_to satellite4 star19 star7)
   deleted: (pointing satellite4 star7)
   added: (pointing satellite4 star19)
   goals met: 20 of 25
47. (turn_to satellite3 phenomenon5 phenomenon26)
   deleted: (pointing satellite3 phenomenon26)
   added: (pointing satellite3 phenomenon5)
   goals met: 19 of 25
48. (take_image satellite3 phenomenon5 instrument5 spectrograph0)
   added: (have_image phenomenon5 spectrograph0)
   goals met: 20 of 25
49. (turn_to satellite3 phenomenon26 phenomenon5)
   deleted: (pointing satellite3 phenomenon5)
   added: (pointing satellite3 phenomenon26)
   goals met: 21 of 25
50. (turn_to satellite3 planet9 phenomenon26)
   deleted: (pointing satellite3 phenomenon26)
   added: (pointing satellite3 planet9)
   goals met: 20 of 25
51. (take_image satellite3 planet9 instrument5 spectrograph0)
   added: (have_image planet9 spectrograph0)
   goals met: 21 of 25
52. (turn_to satellite3 phenomenon26 planet9)
   deleted: (pointing satellite3 planet9)
   added: (pointing satellite3 phenomenon26)
   goals met: 22 of 25
53. (turn_to satellite3 star16 phenomenon26)
   deleted: (pointing satellite3 phenomenon26)
   added: (pointing satellite3 star16)
   goals met: 21 of 25
54. (take_image satellite3 star16 instrument5 spectrograph0)
   added: (have_image star16 spectrograph0)
   goals met: 22 of 25
55. (turn_to satellite3 phenomenon26 star16)
   deleted: (pointing satellite3 star16)
   added: (pointing satellite3 phenomenon26)
   goals met: 23 of 25
56. (turn_to satellite3 star17 phenomenon26)
   deleted: (pointing satellite3 phenomenon26)
   added: (pointing satellite3 star17)
   goals met: 22 of 25
57. (take_image satellite3 star17 instrument5 spectrograph0)
   added: (have_image star17 spectrograph0)
   goals met: 23 of 25
58. (turn_to satellite3 phenomenon26 star17)
   deleted: (pointing satellite3 star17)
   added: (pointing satellite3 phenomenon26)
   goals met: 24 of 25
59. (turn_to satellite3 star27 phenomenon26)
   deleted: (pointing satellite3 phenomenon26)
   added: (pointing satellite3 star27)
   goals met: 23 of 25
60. (take_image satellite3 star27 instrument5 spectrograph0)
   added: (have_image star27 spectrograph0)
   goals met: 24 of 25
61. (turn_to satellite3 phenomenon26 star27)
   deleted: (pointing satellite3 star27)
   added: (pointing satellite3 phenomenon26)
   goals met: 25 of 25
